/* Next-button titles */
"CLOSE" = "Sulje";
"SHUTDOWN" = "Sammuta";
"RESTART" = "Käynnistä";
"LOGOUT" = "Kirjaudu ulos";


/* Messages describing automatic actions the Installer will take once Installation has completed */
"AutoQuit"		= "Asentaja lopettaa automaattisesti %d sekunnin kuluttua.";
"AutoQuit1"		= "Asentaja lopettaa automaattisesti 1 sekunnin kuluttua.";
"AutoMsg"		= "Tietokone %1$@ %2$d sekunnin kuluttua.";
"AutoMsg1"		= "Tietokone %@ 1 sekunnin kuluttua.";

/* action description to be substituted into 'AutoMsg' & 'AutoMsg1' above */
"AutoRestart"	= "käynnistyy uudelleen";
"AutoLogout"	= "kirjaudu ulos";
"AutoShutdown"	= "sammuta";

/* action descriptions indicating actions are currently being performed */
"AutoRestartIsOccurring" = "Tietokone käynnistyy uudelleen.";
"AutoLogoutIsOccurring" = "Tietokone kirjautuu ulos.";
"AutoShutdownIsOccurring" = "Tietokone sammuu.";


/* Messages displayed when the installer requires the user to perform an action to finish installing the software */
"ManualShutDownMsg" = "Viimeistele ohjelman asennus osoittamalla Sammuta.";
"ManualLogoutMsg" = "Lopeta ohjelman asennus osoittamalla Kirjaudu ulos.";
"ManualRequiredRebootMsg" = "Ohjelmiston asennus päätetään osoittamalla Käynnistä.";
"ManualRequiredRebootAfterFailureMsg" = "Yritä asennusta uudelleen osoittamalla Käynnistä uudelleen.";


/* Window titles & descriptions */
"InstallCompletedSuccessfullyTitle" = "Asennus suoritettu.";
"InstallCompletedSuccessfullyDescription" = "Ohjelmisto asennettiin.";
"InstallCompletedWithErrorsTitle" = "Asennuksessa tapahtui virheitä. Haluatko yrittää asennusta uudelleen.";


/* IASPSummaryView class' localizable strings */
"InstallSucceededTitle" = "Asennus onnistui.";
"InstallFailedTitle" = "Asennus epäonnistui.";
